<div class="body_padded" style='direction:rtl;text-align: justify;'>
	<h1>مساعدة  - CAPTCHA غير آمنة</h1>

	<div id="code">
	<table width='100%' bgcolor='white' style="border:2px #C0C0C0 solid">
	<tr>
	<td><div id="code">
		<h3>ما هي الثغرة</h3>
		<p><?php echo dvwaExternalLinkUrlGet( 'https://en.wikipedia.org/wiki/CAPTCHA', 'CAPTCHA' ); ?> هو برنامج يمكنه معرفة ما إذا كان مستخدمه بشرًا أم كمبيوتر. ربما تكون قد تعاملت معه - صور ملونة مع نص مشوه في أسفل حقول الإدخال في تطبيقات الويب. تستخدم العديد من مواقع الويب اختبارات CAPTCHA لتقييد "الروبوتات" أو البرامج المؤتمتة التي تتم كتابتها عادةً لإنشاء بريد عشوائي. لا يوجد برنامج كمبيوتر يمكنه قراءة النصوص المشوهة كما يستطيع البشر ، لذلك لا تستطيع الروبوتات التنقل في المواقع المحمية بواسطة CAPTCHA .</p>

		<p>غالبًا ما تستخدم اختبارات CAPTCHA لحماية الوظائف الحساسة من الروبوتات الآلية. تتضمن هذه الوظيفة عادةً تسجيل حساب جديد وتغيير كلمة المرور ونشر المحتوى. في هذا المثال ، تحمي  CAPTCHA وظيفة تغيير كلمة المرور لحساب المستخدم. يوفر هذا حماية محدودة من هجمات CSRF بالإضافة إلى التخمين الآلي للبوت.</p>

		<br /><hr /><br />

		<h3>الهدف</h3>
		<p>هدفك هو تغيير كلمة مرور المستخدم الحالية بطريقة آلية بسبب ضعف نظام CAPTCHA.</p>

		<br /><hr /><br />

		<h3>المستوى المنخفض</h3>
		<p>تكمن المشكلة في اختبار CAPTCHA في أنه يمكن تجاوزه بسهولة. لقد افترض المطور أن جميع المستخدمين سيبدؤون من خلال الشاشة الأولى، ويكملون اختبار CAPTCHA ، ثم ينتقلون إلى الشاشة التالية حيث يتم تحديث كلمة المرور بالفعل. يمكن للمستخدم تجاوز نظام CAPTCHA  من خلال إرسال كلمة المرور الجديدة مباشرة إلى صفحة التغيير.</p>

		<p>ستكون البارامترات المطلوبة لإكمال هذا التحدي في المستوى المنخفض مماثلة لما يلي:</p>
		<pre style="direction: ltr">?step=2&password_new=password&password_conf=password&Change=Change</pre>

		<br />

		<h3>المستوى المتوسط</h3>
		<p>حاول المطور وضع تحول لتتبع ما إذا كان المستخدم قد أكمل بنجاح اختبار CAPTCHA قبل إرسال البيانات. نظرًا لأن المتحول (pass_captcha)  موجود في من جهة المستخدم client-side، فيمكن للمهاجم أيضًا التلاعب به كما يلي:</p>
		<pre style="direction: ltr">?step=2&password_new=password&password_conf=password&passed_captcha=true&Change=Change.</pre>
		<br />

		<h3>المستوى المرتفع</h3>
		<p>يمكن الاستفادة من جزء موجود في الكود البرمجي استخدمه المطور أثناء التطوير ونسي إزالته عند تشغيل التطبيق في البيئة الحقيقية، يسمح ذلك بتعديل قيم المتحولات المستخدمة في معالجة CAPTCHA.</p>
		<p>عليك تعيير وكيل المستخدم user-agent ليصبح reCAPTCHA  وكذلك استخدام قيمة CAPTCHA في الحقل hidd3n_valu3 لتخطي الاختيار.</p>

		<br />

		<h3>المستوى المستحيل</h3>
		<p>في المستوى المستحيل ، استطاع المطور معالجة جميع طرق الهجوم. تم تبسيط العملية بحيث يتم التحقق من البيانات و CAPTCHA في خطوة واحدة. بدلاً من ذلك ، يمكن للمطور نقل معالة متحول الحالة (في المستوى المتوسط) إلى جهة الخادم server-side، لذلك لا يمكن للمستخدم تغييره.</p>
	</div></td>
	</tr>
	</table>

	</div>

	<br />

	<p>المراجع: <?php echo dvwaExternalLinkUrlGet( 'https://en.wikipedia.org/wiki/CAPTCHA' ); ?></p>
</div>
